/**
 * @class Teller 话务相关类
 * @singleton
 */
Teller ={
	version:'1.0.0',
	minWidth : 250,//窗口最少化的宽度
	heightRatio : 3,//高度占比
	widthRatio : 4, //宽度占比
	error:{
		//自定义  evt error
		'0000':'操作失败，请稍候再试',
		'0001':'控件初始化失败，请联系管理员',
		'0002':'签入失败，请稍候再试',
		'0003':'签出失败，请稍候再试',
		'0004':'找不到配置文件，请联系管理员',
		'0005':'配置文件参数错误，请联系管理员',
		'0006':'打开摄像头失败，请联系管理员',
		'0007':'视频模式不匹配，请联系管理员',
		'0008':'内部呼叫失败，请稍候再试',
		'0009':'转接失败，请稍候再试',
		'0010':'外部呼叫失败，请稍候再试',
		'0012':'录屏失败，请联系管理员',
		'0013':'网络异常，请稍候再试',

		//huawei fn error
		'6':'账号未签入',
		'7':'账号或密码错误',
		'8':'账号已登录',
		'12':'账号已登出',
		'51':'License不足',
		'9009':'账号已登录,请稍候再试',
		'9010':'拒绝登录',
		'9011':'登录失败',
		'9012':'License不足',
		'9013':'License文件已过期',
		'9017':'账号不存在',
		'9018':'工号被锁定,请稍候再试'
	}
};